{
    "foodText": {
        "foodDesc": {
            "definition": "Lasagne are a type of pasta, possibly one of the oldest types,[1] made of very wide, flat sheets. Either term can also refer to an Italian dish made of stacked layers of lasagne alternating with fillings such as ragù (ground meats and tomato sauce), vegetables, cheeses (which may include ricotta, mozzarella, and parmesan), and seasonings and spices, like Italian seasoning, such as garlic, oregano and basil.[2] The dish may be topped with grated cheese, which becomes melted after baking. Typically, cooked pasta is assembled with the other ingredients and then baked in an oven. The resulting casserole is cut into single-serving square portions."
        },
        "foodHistory": "Lasagne originated in Italy during the Middle Ages and have traditionally been ascribed to the city of Naples. The first recorded recipe was set down in the early 14th-century Liber de Coquina (The Book of Cookery).[3] It bore only a slight resemblance to the later traditional form of lasagne, featuring a fermented dough flattened into thin sheets (lasagne), boiled, sprinkled with cheese and spices, and then eaten with a small pointed stick.[4] Recipes written in the century following the Liber de Coquina recommended boiling the pasta in chicken broth and dressing it with cheese and chicken fat. In a recipe adapted for the Lenten fast, walnuts were recommended.[4]    "
    },
    "Ingredients": {
        "id": "1 pound sweet Italian sausage",
        "id": "¾ pound lean ground beef",
        "id": "½ cup minced onion",
        "id": "2 cloves garlic, crushed",
        "id": "1 (28 ounce) can crushed tomatoes",
        "id": "2 (6 ounce) cans tomato paste",
        "id": "2 (6.5 ounce) cans canned tomato sauce",
        "id": "½ cup water",
        "id": "2 tablespoons white sugar",
        "id": "1 ½ teaspoons dried basil leaves",
        "id": "½ teaspoon fennel seeds",
        "id": "1 teaspoon Italian seasoning",
        "id": "1 ½ teaspoons salt, divided, or to taste",
        "id": "¼ teaspoon ground black pepper",
        "id": "4 tablespoons chopped fresh parsley",
        "id": "12 lasagna noodles",
        "id": "16 ounces ricotta cheese",
        "id": "1 egg",
        "id": "¾ pound mozzarella cheese, sliced",
        "id": "¾ cup grated Parmesan cheese"
    },
    "recipeSteps": {
        "step 1": "In a Dutch oven, cook sausage, ground beef, onion, and garlic over medium heat until well browned. Stir in crushed tomatoes, tomato paste, tomato sauce, and water. Season with sugar, basil, fennel seeds, Italian seasoning, 1 teaspoon salt, pepper, and 2 tablespoons parsley. Simmer, covered, for about 1 1/2 hours, stirring occasionally.",
        "step 2": "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain noodles, and rinse with cold water. In a mixing bowl, combine ricotta cheese with egg, remaining parsley, and 1/2 teaspoon salt.",
        "step 3": "Preheat oven to 375 degrees F (190 degrees C).",
        "step 4": "To assemble, spread 1 1/2 cups of meat sauce in the bottom of a 9x13-inch baking dish. Arrange 6 noodles lengthwise over meat sauce. Spread with one half of the ricotta cheese mixture. Top with a third of mozzarella cheese slices. Spoon 1 1/2 cups meat sauce over mozzarella, and sprinkle with 1/4 cup Parmesan cheese. Repeat layers, and top with remaining mozzarella and Parmesan cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.",
        "step 5": "Bake in preheated oven for 25 minutes. Remove foil, and bake an additional 25 minutes. Cool for 15 minutes before serving."
    }
}